import express from "express";
import { dirname } from "path";
import { fileURLToPath } from "url";
import bodyParser from "body-parser";
import pg from "pg";
import bcrypt from "bcrypt";
import session from "express-session";
import passport from "passport";
import { Strategy } from "passport-local";
import env from "dotenv";


const app = express();
const port = 3000;
const __dirname = dirname(fileURLToPath(import.meta.url));
app.use(bodyParser.urlencoded({ extended: true }));
app.use(express.static("public"));
env.config();

app.use(
    session({
        secret: process.env.SESSION_SECRET,
        resave: false,
        saveUninitialized: true,
        cookie: {
            maxAge: 1000 * 60 * 60 * 24
        }
    })
);

app.use(passport.initialize());
app.use(passport.session());

const db = new pg.Client({
    user: process.env.PG_USER,
    host: process.env.PG_HOST,
    database: process.env.PG_DATABASE,
    password: process.env.PG_PASSWORD,
    port: process.env.PG_PORT,
});
db.connect();

const saltRounds = 10;
const text = ["जय हनुमान ज्ञान गुण सागर, जय कपीस तिहुं लोक उजागर॥1॥", "राम दूत अतुलित बलधामा, अंजनी पुत्र पवन सुत नामा॥2॥", "महावीर विक्रम बजरंगी, कुमति निवार सुमति के संगी॥3॥", "कंचन बरन बिराज सुबेसा, कानन कुण्डल कुंचित केसा॥4॥", "हाथबज्र और ध्वजा विराजे, कांधे मूंज जनेऊ साजै॥5॥", "शंकर सुवन केसरी नंदन, तेज प्रताप महा जग वंदन॥6॥", "विद्यावान गुणी अति चातुर, राम काज करिबे को आतुर॥7॥", "प्रभु चरित्र सुनिबे को रसिया, राम लखन सीता मन बसिया॥8॥", "सूक्ष्म रूप धरि सियहिं दिखावा, बिकट रूप धरि लंक जरावा॥9॥", "भीम रूप धरि असुर संहारे, रामचन्द्र के काज संवारे॥10॥", "लाय सजीवन लखन जियाये, श्री रघुवीर हरषि उर लाये॥11॥", "रघुपति कीन्हीं बहुत बड़ाई, तुम मम प्रिय भरत सम भाई॥12॥", "सहस बदन तुम्हरो जस गावैं। अस कहि श्रीपति कंठ लगावैं॥13॥", "सनकादिक ब्रह्मादि मुनीसा,  नारद, सारद सहित अहीसा॥14॥", "जम कुबेर दिगपाल जहां ते, कबि कोबिद कहि सके कहां ते॥15॥", "तुम उपकार सुग्रीवहि कीन्हा, राम मिलाय राजपद दीन्हा॥16॥", "तुम्हरो मंत्र विभीषण माना, लंकेस्वर भए सब जग जाना॥17॥", "जुग सहस्त्र जोजन पर भानू, लील्यो ताहि मधुर फल जानू॥18॥", "प्रभु मुद्रिका मेलि मुख माहि, जलधि लांघि गये अचरज नाहीं॥19॥", "दुर्गम काज जगत के जेते, सुगम अनुग्रह तुम्हरे तेते॥20॥", "राम दुआरे तुम रखवारे, होत न आज्ञा बिनु पैसा रे॥21॥", "सब सुख लहै तुम्हारी सरना, तुम रक्षक काहू को डरना ॥22॥", "आपन तेज सम्हारो आपै, तीनों लोक हांक तें कांपै॥23॥", "भूत पिशाच निकट नहिं आवै, महावीर जब नाम सुनावै॥24॥", "नासै रोग हरै सब पीरा, जपत निरंतर हनुमत बीरा ॥25॥", "संकट तें हनुमान छुड़ावै, मन क्रम बचन ध्यान जो लावै॥26॥", "सब पर राम तपस्वी राजा, तिनके काज सकल तुम साजा॥27॥", "और मनोरथ जो कोइ लावै, सोई अमित जीवन फल पावै॥28॥", "चारों जुग परताप तुम्हारा, है परसिद्ध जगत उजियारा॥29॥", "साधु सन्त के तुम रखवारे, असुर निकंदन राम दुलारे॥30॥", "अष्ट सिद्धि नौ निधि के दाता, अस बर दीन जानकी माता॥31॥", "राम रसायन तुम्हरे पासा, सदा रहो रघुपति के दासा॥32॥", "तुम्हरे भजन राम को पावै, जनम जनम के दुख बिसरावै॥33॥", "अन्त काल रघुबर पुर जाई, जहां जन्म हरि भक्त कहाई॥34॥", "और देवता चित न धरई, हनुमत सेई सर्व सुख करई॥35॥", "संकट कटै मिटै सब पीरा, जो सुमिरै हनुमत बलबीरा॥36॥", "जय जय जय हनुमान गोसाईं, कृपा करहु गुरु देव की नाई॥37॥", "जो सत बार पाठ कर कोई, छूटहि बंदि महा सुख होई॥38॥", "जो यह पढ़ै हनुमान चालीसा, होय सिद्धि साखी गौरीसा॥39॥", "तुलसीदास सदा हरि चेरा, कीजै नाथ हृदय मंह डेरा॥40॥"];
const hindi_text = ["श्री हनुमान जी! आपकी जय हो। आपका ज्ञान और गुण अथाह है। हे कपीश्वर! आपकी जय हो! तीनों लोकों, स्वर्ग लोक, भूलोक और पाताल लोक में आपकी कीर्ति है।", "हे पवनसुत अंजनी नंदन! आपके समान दूसरा बलवान नहीं है।", "हे महावीर बजरंग बली!आप विशेष पराक्रम वाले है। आप खराब बुद्धि को दूर करते है, और अच्छी बुद्धि वालों के साथी, सहायक है।", "आप सुनहले रंग, सुन्दर वस्त्रों, कानों में कुण्डल और घुंघराले बालों से सुशोभित हैं।", "आपके हाथ में बज्र और ध्वजा है और कन्धे पर मूंज के जनेऊ की शोभा है।", "शंकर के अवतार! हे केसरी नंदन आपके पराक्रम और महान यश की संसार भर में वन्दना होती है।", " आप प्रकान्ड विद्या निधान है, गुणवान और अत्यन्त कार्य कुशल होकर श्री राम के काज करने के लिए आतुर रहते है।", "आप श्री राम चरित सुनने में आनन्द रस लेते है। श्री राम, सीता और लखन आपके हृदय में बसे रहते है।", "आपने अपना बहुत छोटा रूप धारण करके सीता जी को दिखलाया और भयंकर रूप करके लंका को जलाया।", "आपने विकराल रूप धारण करके राक्षसों को मारा और श्री रामचन्द्र जी के उद्‍देश्यों को सफल कराया।", "आपने संजीवनी बूटी लाकर लक्ष्मण जी को जिलाया जिससे श्री रघुवीर ने हर्षित होकर आपको हृदय से लगा लिया।", "श्री रामचन्द्र ने आपकी बहुत प्रशंसा की और कहा कि तुम मेरे भरत जैसे प्यारे भाई हो।", "श्री राम ने आपको यह कहकर हृदय से लगा लिया की तुम्हारा यश हजार मुख से सराहनीय है।", "श्री सनक, श्री सनातन, श्री सनन्दन, श्री सनत्कुमार आदि मुनि ब्रह्मा आदि देवता नारद जी, सरस्वती जी, शेषनाग जी सब आपका गुण गान करते है।", " यमराज, कुबेर आदि सब दिशाओं के रक्षक, कवि विद्वान, पंडित या कोई भी आपके यश का पूर्णतः वर्णन नहीं कर सकते।", "आपने सुग्रीव जी को श्रीराम से मिलाकर उपकार किया, जिसके कारण वे राजा बने।", "आपके उपदेश का विभिषण जी ने पालन किया जिससे वे लंका के राजा बने, इसको सब संसार जानता है।", "जो सूर्य इतने योजन दूरी पर है कि उस पर पहुंचने के लिए हजार युग लगे। दो हजार योजन की दूरी पर स्थित सूर्य को आपने एक मीठा फल समझकर निगल लिया।", "आपने श्री रामचन्द्र जी की अंगूठी मुंह में रखकर समुद्र को लांघ लिया, इसमें कोई आश्चर्य नहीं है।", " संसार में जितने भी कठिन से कठिन काम हो, वो आपकी कृपा से सहज हो जाते है।", "श्री रामचन्द्र जी के द्वार के आप रखवाले है, जिसमें आपकी आज्ञा बिना किसी को प्रवेश नहीं मिलता अर्थात् आपकी प्रसन्नता के बिना राम कृपा दुर्लभ है।", "जो भी आपकी शरण में आते है, उस सभी को आनन्द प्राप्त होता है, और जब आप रक्षक है, तो फिर किसी का डर नहीं रहता।", "आपके सिवाय आपके वेग को कोई नहीं रोक सकता, आपकी गर्जना से तीनों लोक कांप जाते है।", "जहां महावीर हनुमान जी का नाम सुनाया जाता है, वहां भूत, पिशाच पास भी नहीं फटक सकते।", "वीर हनुमान जी! आपका निरंतर जप करने से सब रोग चले जाते है और सब पीड़ा मिट जाती है।", " हे हनुमान जी! विचार करने में, कर्म करने में और बोलने में, जिनका ध्यान आपमें रहता है, उनको सब संकटों से आप छुड़ाते है।", "तपस्वी राजा श्री रामचन्द्र जी सबसे श्रेष्ठ है, उनके सब कार्यों को आपने सहज में कर दिया।", "जिस पर आपकी कृपा हो, वह कोई भी अभिलाषा करें तो उसे ऐसा फल मिलता है जिसकी जीवन में कोई सीमा नहीं होती।", "चारो युगों सतयुग, त्रेता, द्वापर तथा कलियुग में आपका यश फैला हुआ है, जगत में आपकी कीर्ति सर्वत्र प्रकाशमान है।", "हे श्री राम के दुलारे! आप सज्जनों की रक्षा करते है और दुष्टों का नाश करते है।", "आपको माता श्री जानकी से ऐसा वरदान मिला हुआ है, जिससे आप किसी को भी आठों सिद्धियां और नौ निधियां दे सकते है।", "आप निरंतर श्री रघुनाथ जी की शरण में रहते है, जिससे आपके पास बुढ़ापा और असाध्य रोगों के नाश के लिए राम नाम औषधि है।", "आपका भजन करने से श्री राम जी प्राप्त होते है और जन्म जन्मांतर के दुख दूर होते है।", "अंत समय श्री रघुनाथ जी के धाम को जाते है और यदि फिर भी जन्म लेंगे तो भक्ति करेंगे और श्री राम भक्त कहलाएंगे।", "हे हनुमान जी! आपकी सेवा करने से सब प्रकार के सुख मिलते है, फिर अन्य किसी देवता की आवश्यकता नहीं रहती।", " हे वीर हनुमान जी! जो आपका सुमिरन करता रहता है, उसके सब संकट कट जाते है और सब पीड़ा मिट जाती है।", " हे स्वामी हनुमान जी! आपकी जय हो, जय हो, जय हो! आप मुझ पर कृपालु श्री गुरु जी के समान कृपा कीजिए।", "जो कोई इस हनुमान चालीसा का सौ बार पाठ करेगा वह सब बंधनों से छूट जाएगा और उसे परमानन्द मिलेगा।", "भगवान शंकर ने यह हनुमान चालीसा लिखवाया, इसलिए वे साक्षी है, कि जो इसे पढ़ेगा उसे निश्चय ही सफलता प्राप्त होगी।", "हे नाथ हनुमान जी! तुलसीदास सदा ही श्री राम का दास है। इसलिए आप उसके हृदय में निवास कीजिए।"];

let count = 0;

app.get("/", (req, res) => {

    res.sendFile(__dirname + "/index.html")

});

app.get("/register", (req, res) => {

    res.render("register.ejs")

})

app.get("/login", async (req, res) => {

    res.render("login.ejs")

})

app.get("/learn", (req, res) => {
    console.log(req.user);
    if (req.isAuthenticated()) {
        res.sendFile(__dirname + "/learn.html");
    } else {
        res.redirect("/login");
    }
});

app.post("/register", async (req, res) => {

    const email = req.body.username;
    const password = req.body.password;
    console.log(email.length)

    if (email.length === 0 || password.length === 0) {
        // Render the registration page with an error message
        return res.render("register.ejs", { error: "Please fill in all fields." });
    }

    try {
        const result = await db.query("select * from userinfo where username = ($1)", [email]);

        if (result.rows.length > 0) {
            res.send("Email already exists. Try to login");
        }
        else {
            bcrypt.hash(password, saltRounds, async (err, hash) => {
                if (err) {
                    res.send("error hashing pass", err)
                }
                else {
                    const result = await db.query("insert into userinfo (username, password) values ($1, $2) returning *", [email, hash]);
                    const user = result.rows[0];

                    req.login(user, (err) => {
                        console.log(err)
                        res.redirect("/learn");
                    })
                }
            })
        }
    }
    catch (err) {
        console.log(err)
    }

})

app.post(
    "/login",
    passport.authenticate("local", {
        successRedirect: "/learn",
        failureRedirect: "/login",
    })
);


passport.use(
    new Strategy(async function verify(username, password, cb) {
        try {
            const result = await db.query("SELECT * FROM userinfo WHERE username = $1 ", [
                username,
            ]);
            if (result.rows.length > 0) {
                const user = result.rows[0];
                const storedHashedPassword = user.password;
                bcrypt.compare(password, storedHashedPassword, (err, valid) => {
                    if (err) {
                        //Error with password check
                        console.error("Error comparing passwords:", err);
                        return cb(err);
                    } else {
                        if (valid) {
                            //Passed password check
                            return cb(null, user);
                        } else {
                            //Did not pass password check
                            return cb(null, false);
                        }
                    }
                });
            } else {
                return cb("User not found");
            }
        } catch (err) {
            console.log(err);
        }
    })
);

passport.serializeUser((user, cb) => {
    cb(null, user);
});
passport.deserializeUser((user, cb) => {
    cb(null, user);
});

app.listen(port, () => {
    console.log("server started");
})